Revit 2024 API
PaperSourceSet.Erase Method
Removes a specified object from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual int Erase(
	PaperSource item
)
Visual Basic
Public Overridable Function Erase ( _
	item As PaperSource _
) As Integer
Visual C++
public:
virtual int Erase(
	PaperSource^ item
)
Parameters
item
Type: Autodesk.Revit.DB.PaperSource
The item to be erased.
Return Value
The number of items that were erased from the set.
See Also
PaperSourceSet Class
Autodesk.Revit.DB Namespace